Revit 2024 API
RebarUpdateCurvesData.IsSpacingChanged Property
 Indicates if the spacing has changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool IsSpacingChanged { get; }
Visual Basic
Public ReadOnly Property IsSpacingChanged As Boolean
	Get
Visual C++
public:
property bool IsSpacingChanged {
	bool get ();
}
See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace